import React, { Component } from "react";
import { connect } from "react-redux";
import { mapStateToProps } from "../../app/redux";
import { HtmlHead } from "../../app/components/html-head";
import DefaultLayout from "../../app/components/default-layout";

const basePath = require("./../../base_path");

class History extends Component {
  render() {
    return (
      <>
        <HtmlHead
          prefixTitle="ประวัติสาขาวิชา"
          path="history"
          img={`${basePath()}assets/img/mathstat.jpg`}
        />
        <DefaultLayout>
          <div className="box-padding" style={{ textAlign: "center" }}>
            <img
              src={`${basePath()}assets/img/mathstat.jpg`}
              alt="mathstst"
              style={{ width: "100%", maxWidth: "700px" }}
            />
          </div>
          <h5 className="mt-3">
            <b>ประวัติสาขาคณิตศาสตร์และสถิติประยุกต์</b>
          </h5>
          <div className="box-padding">
            ในปี พ.ศ. 2518-2530 มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน
            มีชื่อเรียกเดิมว่า วิทยาลัยเทคโนโลยีและอาชีวศึกษา ต่อมาในปี
            2531-2547 ได้เปลี่ยนชื่อเป็น สถาบันเทคโนโลยีราชมงคล นครราชสีมา
            และมีคณะศึกษาทั่วไป ซึ่งมีแผนกวิชาคณิตศาสตร์ โดยมี 1. อาจารย์
            กนกวรรณ พันจิตต์ และ 2. ผศ. บังอร วินิจนัยภาค
            เป็นหัวหน้าแผนกตามลำดับ ต่อมาในปีพ.ศ.2548-ปัจจุบัน
            ได้เปลี่ยนชื่ออีกครั้งเป็น มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน
            นครราชสีมา และมีคณะวิทยาศาสตร์และศิลปศาสตร์
            สาขาคณิตศาสตร์และสถิติประยุกต์ โดยมี 1. ผศ. บังอร วินิจนัยภาค 2.
            อาจารย์ อิสเรส อิสระสุข 3. ผศ.ดร. พรทิพย์ ป้องชาลี 4. ผศ.ดร.
            ณรงค์ศักดิ์ โยธา เป็นหัวหน้าสาขาตามลำดับ
            ปัจจุบันสาขาคณิตศาสตร์และสถิติประยุกต์มีสถานที่ตั้งอยู่ที่ตึก 34
            ชั้น 6 โดยมีห้องพักอาจารย์อยู่ 3 ห้องคือ ห้อง 603, 610 และห้อง 611
            ปัจจุบันมีอาจารย์ประจำสาขาทั้งหมด 18
            ท่านซึ่งเป็นอาจารย์ทางคณิตศาสตร์ 12 ท่านและเป็นอาจารย์ทางสถิติอีก 6
            ท่าน ภารกิจหลักของสาขาวิชาคณิตศาสตร์และสถิติประยุกต์ ได้แก่
            การเรียนการสอน การวิจัย การบริการแก่ชุมชนและการทำนุบำรุงศิลปวัฒนธรรม
            ปัจจุบัน สาขาคณิตศาสตร์และสถิติประยุกต์เปิดสอน 1 หลักสูตร คือ
            ระดับปริญญาตรี หลักสูตร วิทยาศาสตร์บัณฑิต (สถิติประยุกต์)
          </div>
          <h5>
            <b>ปรัชญา</b>
          </h5>
          <div className="box-padding">
            คณิตศาสตร์และสถิติเป็นรากฐานสำคัญทางวิทยาศาสตร์ และ สาขาอื่น ๆ
            ดำเนินไปบนพื้นฐานของการแสวงหาความจริงอย่างมีระบบ และ มีเหตุมีผล
            ผ่านกระบวนการทางความคิด ค้นคว้าและวิจัย เพื่อนำมาซึ่งองค์ความรู้ และ
            ทฤษฎีใหม่ ๆ ทางคณิตศาสตร์และสถิติ
            สาขาวิชาคณิตศาสตร์และสถิติประยุกต์ในฐานะองค์กรการศึกษา
            จักต้องใช้องค์ความรู้ทั้งที่มีอยู่แล้วและพึงแสวงหาใหม่
            เพื่อเพิ่มพูนและเสริมสร้างความก้าวหน้าทางวิชาการด้านคณิตศาสตร์และสถิติ
            เพื่อสร้างสรรค์สังคมแห่งการเรียนรู้
            ซึ่งจะนำไปสู่การพัฒนาที่ยั่งยืนของประเทศต่อไปผลิตนักคณิตศาสตร์ที่มีคุณภาพ
            ทั้งด้านความรู้ จริยธรรม และคุณธรรม
            มีการวิจัยทางคณิตศาสตร์ที่มีคุณภาพในระดับสากล มีการบริหารจัดการที่ดี
          </div>
          <h5>
            <b>วิสัยทัศน์</b>
          </h5>
          <div className="box-padding">
            สาขาคณิตศาสตร์และสถิติประยุกต์เป็นแหล่งผลิตนักคณิตศาสตร์และสถิติที่มีคุณภาพ
            ทั้งด้านความรู้ จริยธรรม คุณธรรม และเป็นบัณฑิตนักปฏิบัติ
            มีการวิจัยทางคณิตศาสตร์ที่มีคุณภาพในระดับประเทศและระดับสากล
            มีการบริหารจัดการที่ดี
          </div>
          <h5>
            <b>พันธกิจ</b>
          </h5>
          <div className="box-padding">
            <ol>
              <li>
                จัดการเรียนการสอนทระดับปริญญาตรีให้แก่นักศึกษาทั้งภายในและภายนอกคณะ
                โดยมุ่งเน้นคุณภาพตามมาตรฐานสากล
              </li>
              <li>
                ดำเนินการวิจัยทางคณิตศาสตร์และสถิติ ทั้งการวิจัยพื้นฐานและ
                ประยุกต์ในสาขาต่างๆ ที่มีคุณภาพระดับชาติและระดับนานาชาติ
                สามารถนำมาใช้ประโยชน์ในการพัฒนาเศรษฐกิจ
                สังคมและสร้างขีดความสามารถในการแข่งขันของประเทศ
              </li>
              <li>
                ให้บริการวิชาการแก่ชุมชนอย่างมีคุณภาพ
                สามารถตอบสนองความต้องการพัฒนาท้องถิ่นภาคอีสานและประเทศ
              </li>
              <li>
                มีส่วนร่วมในการทำนุบำรุงศิลปวัฒนธรรม
                ขนบธรรมเนียมประเพณีของท้องถิ่นภาคอีสาน
                และอนุรักษ์ทรัพยากรธรรมชาติเพื่อสิ่งแวดล้อมที่ดี
              </li>
              <li>
                บริหารและจัดการตามหลักธรรมาภิบาล
                พึ่งพาตนเองโดยใช้หลักปรัชญาเศรษฐกิจพอเพียง
              </li>
            </ol>
          </div>
          <h5>
            <b>วัตถุประสงค์</b>
          </h5>
          <div className="box-padding">
            <ol>
              <li>
                เพื่อผลิตบัณฑิตนักปฏิบัติที่มีความรู้และทักษะทางคณิตศาสตร์และสถิติ
                ทัดเทียมกับสถาบันอุดมศึกษาชั้นนำของประเทศและต่างประเทศ
                สามารถนำไปประยุกต์ในการทำงานและการศึกษาต่อ เป็นคนดี
                มีคุณธรรมจริยธรรม มีจิตสำนึกต่อสังคมและสิ่งแวดล้อม
                สามารถดำรงชีวิตในสังคมได้อย่างมีความสุข
              </li>
              <li>
                เพื่อผลิตงานวิจัยที่ได้มาตรฐานในระดับชาติและระดับสากล
                มีประโยชน์ต่อการเรียนการสอน การพัฒนาเศรษฐกิจสังคม
                และการสร้างขีดความสามารถในการแข่งขันของประเทศ
              </li>
              <li>
                เพื่อให้ชุมชนท้องถิ่นภาคอีสานและประเทศได้รับการบริการทางวิชาการที่มีคุณภาพ
                จากศักยภาพของทรัพยากรบุคคลและผลงานวิชาการของสาขาคณิตศาสตร์และสถิติประยุกต์
              </li>
              <li>
                เพื่อการมีส่วนร่วมในการทำนุบำรุงศิลปวัฒนธรรมของท้องถิ่นภาคอีสาน
                และการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อมของท้องถิ่นภาคอีสานและประเทศ
              </li>
              <li>
                พื่อให้สาขาคณิตศาสตร์และสถิติประยุกต์มีระบบบริหารงานที่โปร่งใส
                ตรวจสอบได้
                มีการใช้เทคโนโลยีในการบริหารจัดการตามแนวทางของคณะวิทยาศาสตร์และศิลปศาสตร์
              </li>
              <li>
                เพื่อให้ได้มาซึ่งทรัพยากรและรายได้สนับสนุนการบริหารจัดการในทุกด้านอย่างเหมาะสม
                พอเพียง
              </li>
            </ol>
          </div>
          <h5>
            <b>
              วัตถุประสงค์ นโยบายการบริหารและพัฒนาสาขาคณิตศาสตร์และสถิติประยุกต์
              (พ.ศ. 2558 – 2563)
            </b>
          </h5>
          <div className="box-padding">
            <ol>
              <li>
                นโยบายด้านการเรียนการสอน
                <ul style={{ listStyleType: "disc" }}>
                  <li>
                    พัฒนาการเรียนการสอนเพื่อผลิตบัณฑิตนักปฏิบัติที่มีประสิทธิภาพ
                    เป็นที่ยอมรับของสังคม
                    สนองความต้องการของประเทศด้านครูคณิตศาสตร์
                  </li>
                  <li>
                    สร้างความร่วมมือกับต่างคณะในการพัฒนาหลักสูตรร่วมที่มีคุณลักษณะที่สามารถแข่งขันกับมหาวิทยาลัยอื่นได้
                    และสามารถดึงดูดนักเรียน นักศึกษาที่มีสติปัญญาดีเข้ามาศึกษา
                  </li>
                  <li>
                    พัฒนากระบวนวิชาให้เหมาะสม
                    สอดคล้องกับความต้องการของเจ้าของหลักสูตร
                  </li>
                  <li>มีระบบการประกันคุณภาพการศึกษาของหลักสูตร</li>
                </ul>
              </li>
              <li>
                นโยบายด้านการวิจัย
                <ul style={{ listStyleType: "disc" }}>
                  <li>
                    กำหนดทิศทางการวิจัยให้สอดคล้องกับทิศทางการวิจัยของคณะและมหาวิทยาลัย
                  </li>
                  <li>
                    ส่งเสริมและสนับสนุนการทำวิจัยของคณาจารย์ ทั้งทางด้านพื้นฐาน
                    การประยุกต์ และการบูรณาการ
                  </li>
                  <li>
                    สนับสนุนวัสดุ ครุภัณฑ์ อุปกรณ์ที่ทันสมัยสำหรับการวิจัย
                  </li>
                  <li>ส่งเสริมและสนับสนุนการหาแหล่งทุนวิจัยอย่างต่อเนื่อง</li>
                  <li>
                    แสวงหาความร่วมมือทางวิชาการกับหน่วยงานภายนอก
                    และสถาบันการศึกษาทั้งในประเทศและต่างประเทศ
                  </li>
                </ul>
              </li>
              <li>
                นโยบายด้านการบริการวิชาการ
                <ul style={{ listStyleType: "disc" }}>
                  <li>
                    กำหนดให้มีการดำเนินการบริการทางวิชาการ
                    เพื่อสนองความต้องการของชุมชนท้องถิ่นและของประเทศ
                  </li>
                  <li>
                    ส่งเสริมและสนับสนุนให้คณาจารย์และบุคลากรได้มีโอกาสใช้ความรู้ความสามารถ
                    ในการพัฒนาชุมชนท้องถิ่นและประเทศ
                  </li>
                </ul>
              </li>
              <li>
                เนโยบายด้านการทำนุบำรุงศิลปวัฒนธรรมและอนุรักษ์สิ่งแวดล้อม
                <ul style={{ listStyleType: "disc" }}>
                  <li>
                    ส่งเสริมให้คณาจารย์ บุคลากรและนักศึกษา
                    ร่วมกันทำนุบำรุงศิลปวัฒนธรรม
                    และรักษาขนบธรรมเนียมประเพณีของท้องถิ่น
                  </li>
                  <li>
                    ส่งเสริมและปลูกฝังให้มีการอนุรักษ์ธรรมชาติ
                    เพื่อรักษาสิ่งแวดล้อมที่ดี
                  </li>
                </ul>
              </li>
              <li>
                นโยบายด้านการบริหาร
                <ul style={{ listStyleType: "disc" }}>
                  <li>
                    มีการจัดทำแผนการดำเนินงานอย่างเป็นรูปธรรม
                    มีขั้นตอนที่สามารถตรวจสอบได้
                  </li>
                  <li>
                    ให้คณาจารย์และบุคลากรมีส่วนร่วมในการบริหารงานอย่างทั่วถึง
                  </li>
                  <li>พัฒนาระบบการทำงานของบุลากรให้มีประสิทธิภาพมากยิ่งขึ้น</li>
                  <li>
                    นำระบบเทคโนโลยีสารสนเทศช่วยในการบริหารงาน
                    ให้เกิดความคล่องตัว และการประหยัดงบประมาณ
                  </li>
                  <li>มีการประเมินการบริหารงานของภาควิชา</li>
                  <li>
                    มีการประสานงานกับศิษย์เก่า
                    เพื่อสร้างความสัมพันธ์กับศิษย์ปัจจุบันอย่างต่อเนื่อง
                  </li>
                </ul>
              </li>
            </ol>
          </div>
        </DefaultLayout>
      </>
    );
  }
}

export default connect(mapStateToProps)(History);
